[Obelisk - Populate Summary Index 1]
search = `obelisk_index` threat_list_name=AlienVault_IP_Blocklist | stats dc(dest_ip) as alienvault_dest_ip_count
dispatch.latest_time = now
dispatch.earliest_time = -4h
enableSched = 1
action.summary_index._name = summary
cron_schedule = 12 0,4,8,12,16,20 * * *
description = Obelisk Count AlientVault IPs
action.summary_index = 1

[Obelisk - Populate Summary Index 2]
search = `obelisk_index` threat_list_name=HP_Hosts_By_MalwareBytes | stats dc(dest) as hp_hosts_dest_count
dispatch.latest_time = now
dispatch.earliest_time = -4h
enableSched = 1
action.summary_index._name = summary
cron_schedule = 15 0,4,8,12,16,20 * * *
description = Obelisk Count HP Hosts Domains
action.summary_index = 1

[Obelisk - Populate Summary Index 3]
search = `obelisk_index` threat_list_name=CI_Army_Badguys_IPs | stats dc(dest_ip) as ci_army_badguys_dest_ip_count
dispatch.latest_time = now
dispatch.earliest_time = -4h
enableSched = 1
action.summary_index._name = summary
cron_schedule = 17 0,4,8,12,16,20 * * *
description = Obelisk Count CI Army Badguys IPs
action.summary_index = 1

[Obelisk - Populate Summary Index 4]
search = `obelisk_index` threat_list_name=Phish_Tank_URLs | stats dc(url) as phish_tank_url_count
dispatch.latest_time = now
dispatch.earliest_time = -4h
enableSched = 1
action.summary_index._name = summary
cron_schedule = 19 0,4,8,12,16,20 * * *
description = Obelisk Count Phish Tank
action.summary_index = 1

[Obelisk - Threat List Hit on Destination IP - Summary 1]
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 44 0,4,8,12,16,20 * * *
alert.track = 0
dispatch.latest_time = now
alert.suppress = 0
disabled = 1
search = (`network_index_one` OR `obelisk_index`) dest_ip=* | stats values(*) AS * dc(index) AS indices by dest_ip | where indices = 2 | lookup dnslookup clientip as src_ip OUTPUT clienthost as hostname | table index sourcetype dest_ip host threat_list_name hostname
enableSched = 1
dispatch.earliest_time = -4h
alert.digest_mode = True
realtime_schedule = 0
description = A destination IP address matching a threat list has been detected in your organization's machine data.
action.summary_index = 1

[Obelisk - Threat List Hit on Destination IP - Summary 2]
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 49 0,4,8,12,16,20 * * *
alert.track = 0
dispatch.latest_time = now
alert.suppress = 0
disabled = 1
search = (`network_index_two` OR `obelisk_index`) dest_ip=* | stats values(*) AS * dc(index) AS indices by dest_ip | where indices = 2 | lookup dnslookup clientip as src_ip OUTPUT clienthost as hostname | table index sourcetype dest_ip host threat_list_name hostname
enableSched = 1
dispatch.earliest_time = -4h
alert.digest_mode = True
realtime_schedule = 0
description = A destination IP address matching a threat list has been detected in your organization's machine data.
action.summary_index = 1

[Obelisk - Threat List Hit on Destination IP - Summary 3]
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 54 0,4,8,12,16,20 * * *
alert.track = 0
dispatch.latest_time = now
alert.suppress = 0
disabled = 1
search = (`network_index_three` OR `obelisk_index`) dest_ip=* | stats values(*) AS * dc(index) AS indices by dest_ip | where indices = 2 | lookup dnslookup clientip as src_ip OUTPUT clienthost as hostname | table index sourcetype dest_ip host threat_list_name hostname
enableSched = 1
dispatch.earliest_time = -4h
alert.digest_mode = True
realtime_schedule = 0
description = A destination IP address matching a threat list has been detected in your organization's machine data.
action.summary_index = 1

[Obelisk Populate Lookup - AlienVault - dest_ip]
search = `obelisk_index` dest_ip=* earliest=-48h threat_list_name=AlienVault_IP_Blocklist\
| dedup dest_ip threat_description region threat_list_name\
| table dest_ip threat_description region threat_list_name\
| outputlookup AlienVault_IP_Blocklist
schedule_window = 5
auto_summarize.dispatch.earliest_time = -1d@h
request.ui_dispatch_view = search
cron_schedule = 5 */4 * * *
enableSched = 1
display.page.search.tab = statistics
alert.track = 0
display.visualizations.show = 0
display.page.search.mode = fast
display.general.type = statistics
dispatch.latest_time = now
request.ui_dispatch_app = obelisk_threat_intel
action.email.useNSSubject = 1
dispatch.earliest_time = -1d
alert.suppress = 0
alert.digest_mode = True

[Obelisk Populate Lookup - CI_Army_Badguys - dest_ip]
search = `obelisk_index` dest_ip=* threat_list_name=CI_Army_Badguys_IPs\
| dedup dest_ip\
| table dest_ip threat_list_name\
| outputlookup CI_Army_Badguys_IPs
request.ui_dispatch_view = search
cron_schedule = 30 */4 * * *
schedule_window = 5
alert.track = 0
display.visualizations.show = 0
display.page.search.tab = statistics
display.general.type = statistics
dispatch.earliest_time = -48h
dispatch.latest_time = now
enableSched = 1
action.email.useNSSubject = 1
request.ui_dispatch_app = obelisk_threat_intel

[Obelisk Populate Lookup - EmergingThreats - dest_ip]
search = `obelisk_index` dest_ip=* threat_list_name=Emerging_Threats_Compromised_IPs\
| dedup dest_ip\
| table dest_ip threat_list_name\
| outputlookup Emerging_Threats_Compromised_IPs
request.ui_dispatch_view = search
cron_schedule = 25 */4 * * *
schedule_window = 5
alert.track = 0
display.visualizations.show = 0
display.page.search.tab = statistics
display.general.type = statistics
enableSched = 1
dispatch.earliest_time = -48h
dispatch.latest_time = now
action.email.useNSSubject = 1
request.ui_dispatch_app = obelisk_threat_intel

[Obelisk Populate Lookup - Spamhaus_Drop_Nets - dest_ip]
search = `obelisk_index` dest_ip=*  threat_list_name=Spamhaus_Drop_Nets\
| dedup dest_ip\
| table dest_ip threat_list_name\
| outputlookup Spamhaus_Drop_Nets
request.ui_dispatch_view = search
cron_schedule = 40 */4 * * *
schedule_window = 5
alert.track = 0
display.visualizations.show = 0
display.page.search.tab = statistics
display.general.type = statistics
dispatch.earliest_time = -48h
dispatch.latest_time = now
enableSched = 1
action.email.useNSSubject = 1
request.ui_dispatch_app = obelisk_threat_intel

[Obelisk Populate Lookup - Talos Intel IPs - dest ip]
search = `obelisk_index` dest_ip=*  threat_list_name=talos_intel_IPs\
| dedup dest_ip\
| table dest_ip threat_list_name\
| outputlookup talos_intel_IPs
schedule_window = 5
auto_summarize.dispatch.earliest_time = -1d@h
request.ui_dispatch_view = search
cron_schedule = 15 */4 * * *
enableSched = 1
display.page.search.tab = statistics
alert.track = 0
display.visualizations.show = 0
display.page.search.mode = fast
display.general.type = statistics
dispatch.latest_time = now
request.ui_dispatch_app = obelisk_threat_intel
action.email.useNSSubject = 1
dispatch.earliest_time = -1d
alert.suppress = 0
alert.digest_mode = True

[Obelisk Populate Lookup - TorExitNodes - dest ip]
search = `obelisk_index` dest_ip=* earliest=-48h threat_list_name=TorExitNodes\
| dedup dest_ip\
| table dest_ip threat_list_name\
| outputlookup TorExitNodes
schedule_window = 5
auto_summarize.dispatch.earliest_time = -1d@h
request.ui_dispatch_view = search
cron_schedule = 20 */4 * * *
enableSched = 1
display.page.search.tab = statistics
alert.track = 0
display.visualizations.show = 0
display.page.search.mode = fast
display.general.type = statistics
dispatch.latest_time = now
request.ui_dispatch_app = obelisk_threat_intel
action.email.useNSSubject = 1
dispatch.earliest_time = -1d
alert.suppress = 0
alert.digest_mode = True

[Obelisk Populate Lookup - all threat lists]
search = | inputlookup AlienVault_IP_Blocklist  | dedup threat_list_name dest_ip| fields threat_list_name dest_ip \
| append [|inputlookup talos_intel_IPs  | dedup threat_list_name dest_ip| fields threat_list_name dest_ip]\
| append [|inputlookup TorExitNodes  | dedup threat_list_name dest_ip| fields threat_list_name dest_ip]\
| append [|inputlookup Emerging_Threats_Compromised_IPs  | dedup threat_list_name dest_ip| fields threat_list_name dest_ip]\
| append [|inputlookup CI_Army_Badguys_IPs  | dedup threat_list_name dest_ip| fields threat_list_name dest_ip]\
| append [|inputlookup ransomware_Abuse_CH_IPs  | dedup threat_list_name dest_ip| fields threat_list_name dest_ip]\
| append [|inputlookup bambenekIPs  | dedup threat_list_name dest_ip| fields threat_list_name dest_ip]\
| outputlookup all_dest_ips.csv
auto_summarize.dispatch.earliest_time = -1d@h
request.ui_dispatch_view = search
cron_schedule = 56 */4 * * *
display.page.search.tab = statistics
alert.track = 0
display.visualizations.show = 0
display.general.type = statistics
enableSched = 1
action.email.useNSSubject = 1
alert.suppress = 0
dispatch.earliest_time = -1d@h
request.ui_dispatch_app = obelisk_threat_intel
alert.digest_mode = True

[Obelisk Populate Lookups - ransomware Abuse.ch IPs - dest_ip]
action.email.useNSSubject = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 45 */4 * * *
enableSched = 1
dispatch.earliest_time = -1d@h
dispatch.latest_time = now
request.ui_dispatch_app = obelisk_threat_intel
request.ui_dispatch_view = search
schedule_window = 5
search = `obelisk_index` dest_ip=* earliest=-48h threat_list_name=ransomware_Abuse_CH_IPs\
| dedup dest_ip\
| table dest_ip threat_list_name\
| outputlookup ransomware_Abuse_CH_IPs

[Obelisk Populate Lookups - bambenekIPs - dest_ip]
search = `obelisk_index` dest_ip=*  threat_list_name=bambenekIPs\
| dedup dest_ip\
| table dest_ip threat_list_name\
| outputlookup bambenekIPs
request.ui_dispatch_view = search
cron_schedule = 52 */4 * * *
schedule_window = 5
alert.track = 0
display.visualizations.show = 0
display.page.search.tab = statistics
display.general.type = statistics
enableSched = 1
dispatch.earliest_time = -48h
dispatch.latest_time = now
action.email.useNSSubject = 1
request.ui_dispatch_app = obelisk_threat_intel

#[Obelisk Threat List Hit on Destination IP Email Alert - Index 1]
#alert.suppress.period = 1h
#quantity = 0
#request.ui_dispatch_app = search
#disabled = 0
#alert.severity = 3
#search = (`network_index_one`) dest_ip=* \
#| lookup local=1 all_dest_ips.csv dest_ip OUTPUT threat_list_name, dest_ip  \
#| search threat_list_name=* \
#| dedup dest_ip \
#| eval dest_ip=mvindex(dest_ip,0) \
#| lookup dnslookup clientip as src_ip OUTPUT clienthost as hostname\
#| eval sourcetype_match=sourcetype\
#| eval index_match=index\
#| eval host_match=host\
#| table index_match sourcetype_match dest_ip host_match threat_list_name hostname\
#| iplocation dest_ip \
#| fields - lat - lon
#action.email = 1
#action.email.useNSSubject = 1
#relation = greater than
#action.email.sendpdf = 1
#alert.digest_mode = 1
#description = Threat List hit on a destination IP email alert Index 1
#cron_schedule = 35 2,14 * * *
#action.email.sendresults = 1
#display.general.type = statistics
#auto_summarize.dispatch.earliest_time = -12h@h
#request.ui_dispatch_view = search
#display.events.fields = ["host","source","sourcetype","dest_ip"]
#dispatch.latest_time = now
#alert.suppress = 1
#display.visualizations.show = 0
#enableSched = 1
#dispatch.earliest_time = -12h
#display.page.search.tab = statistics
#counttype = number of events
#alert.track = 1

#[Obelisk Threat List Hit on Destination IP Email Alert - Index 2]
#alert.suppress.period = 1h
#quantity = 0
#request.ui_dispatch_app = search
#disabled = 0
#alert.severity = 3
#search = (`network_index_two`) dest_ip=* \
#| lookup local=1 all_dest_ips.csv dest_ip OUTPUT threat_list_name, dest_ip  \
#| search threat_list_name=* \
#| dedup dest_ip \
#| eval dest_ip=mvindex(dest_ip,0) \
#| lookup dnslookup clientip as src_ip OUTPUT clienthost as hostname\
#| eval sourcetype_match=sourcetype\
#| eval index_match=index\
#| eval host_match=host\
#| table index_match sourcetype_match dest_ip host_match threat_list_name hostname\
#| iplocation dest_ip \
#| fields - lat - lon
#action.email = 1
#action.email.useNSSubject = 1
#relation = greater than
#action.email.sendpdf = 1
#alert.digest_mode = 1
#description = Threat List hit on a destination IP email alert Index 2
#cron_schedule = 45 1,13 * * *
#action.email.sendresults = 1
#display.general.type = statistics
#auto_summarize.dispatch.earliest_time = -12h@h
#request.ui_dispatch_view = search
#display.events.fields = ["host","source","sourcetype","dest_ip"]
#dispatch.latest_time = now
#alert.suppress = 1
#display.visualizations.show = 0
#enableSched = 1
#dispatch.earliest_time = -12h
#display.page.search.tab = statistics
#counttype = number of events
#alert.track = 1

#[Obelisk Threat List Hit on Destination IP Email Alert - Index 3]
#alert.suppress.period = 1h
#quantity = 0
#request.ui_dispatch_app = search
#disabled = 0
#alert.severity = 3
#search = (`network_index_three`) dest_ip=* \
#| lookup local=1 all_dest_ips.csv dest_ip OUTPUT threat_list_name, dest_ip  \
#| search threat_list_name=* \
#| dedup dest_ip \
#| eval dest_ip=mvindex(dest_ip,0) \
#| lookup dnslookup clientip as src_ip OUTPUT clienthost as hostname\
#| eval sourcetype_match=sourcetype\
#| eval index_match=index\
#| eval host_match=host\
#| table index_match sourcetype_match dest_ip host_match threat_list_name hostname\
#| iplocation dest_ip \
#| fields - lat - lon
#action.email = 1
#action.email.useNSSubject = 1
#relation = greater than
#action.email.sendpdf = 1
#alert.digest_mode = 1
#description = Threat List hit on a destination IP email alert Index 3
#cron_schedule = 15 3,15 * * *
#action.email.sendresults = 1
#display.general.type = statistics
#auto_summarize.dispatch.earliest_time = -1d@h
#request.ui_dispatch_view = search
#display.events.fields = ["host","source","sourcetype","dest_ip"]
#dispatch.latest_time = now
#alert.suppress = 1
#display.visualizations.show = 0
#enableSched = 1
#dispatch.earliest_time = -12h
#display.page.search.tab = statistics
#counttype = number of events
#alert.track = 1

[Obelisk Threat list activity 3 network indexes by dest_ip]
search = (`network_index_one` OR `network_index_two` OR `network_index_three`) dest_ip=*  | lookup local=1 all_dest_ips.csv dest_ip OUTPUT threat_list_name, dest_ip  | search threat_list_name=* | dedup dest_ip | eval dest_ip=mvindex(dest_ip,0) | lookup dnslookup clientip as src_ip OUTPUT clienthost as hostname | table index sourcetype dest_ip host threat_list_name hostname | iplocation dest_ip | fields - lat - lon
request.ui_dispatch_view = search
request.ui_dispatch_app = obelisk_threat_intel
alert.track = 0
display.visualizations.show = 0
display.page.search.mode = fast
display.general.type = statistics
dispatch.latest_time = now
action.email.useNSSubject = 1
dispatch.earliest_time = -12h
display.page.search.tab = statistics
